app/Controllers/Mahasiswa.php

public function formedit()
{
    if($this->request->isAJAX()){
        $id_mahasiswa007 = $this->request->getVar('id_mahasiswa007');

        $mhs = new Modelmahasiswa;
        $row = $mhs->find($id_mahasiswa007);
---
SELECT *
FROM `mahasiswa007`
WHERE `mahasiswa007`.`id_mahasiswa007` = '1'

 public function hapus()
{
    if($this->request->isAJAX()){
      $id_mahasiswa007=$this->request->getVar('id_mahasiswa007');
      $mhs= new Modelmahasiswa;

      $mhs->delete($id_mahasiswa007);
---
DELETE FROM `mahasiswa007`
WHERE `id_mahasiswa007` IN ('2')